# SetWorksetConfiguration Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkOptions..::..SetWorksetConfiguration Method
RevitLinkOptions Class See Also
---
Sets the set of worksets to open when creating the link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetWorksetConfiguration(
	WorksetConfiguration config
)
```

Visual Basic
---
```text
Public Sub SetWorksetConfiguration ( _
	config As WorksetConfiguration _
)
```

Visual C++
---
```text
public:
void SetWorksetConfiguration(
	WorksetConfiguration^ config
)
```

# ### Parameters
config
    Type: Autodesk.Revit.DB..::..WorksetConfiguration
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RevitLinkOptions Class
Autodesk.Revit.DB Namespace